Repository: IanKHall/CCA-OSX
Catalog: Colour Contrast Analyser/*.lproj/Localizable.strings
Languages: fr

source: Contrast Ratio:
fr: Ratio de contraste:

# contrast_ratio_below
source: Contrast Ratio: just below
fr: Ratio de contraste: juste en dessous de

# colour_diff
source: Colour difference: %d (minimum 500)
fr: Différence de couleurs: %d (minimum 500)

# brightness_diff
source: Brightness difference: %d (minimum 125)
fr: Différence d'intensité: %d (minimum 125)

source: Pass
fr: Conforme

source: Fail
fr: Echec

# results_format
source: Foreground: %F - Background: %B The contrast ratio is: %L %AAN %AAAN %AAL %AAAL 1.4.3 Contrast (Minimum): Text (and images of text) have a contrast ratio of at least 4.5:1, except if the text is pure decoration. Larger scale text (at least 18 point or 14 point bold) or images of text can have a contrast ratio of 3:1. (Level AA) 1.4.6 Contrast (Enhanced): Text (and images of text) have a contrast ratio of at least 7:1, except if the text is pure decoration. Larger scale text (at least 18 point or 14 point bold) or images of text can have a contrast ratio of 4.5:1. (Level AAA) Note: Fonts that are extraordinarily thin or decorative are harder to read at lower contrast levels.
fr: Premier plan: %F - Arrière plan: %B Le ratio de contraste est de: %L %AAN %AAAN %AAL %AAAL 1.4.3 Contraste (Minimum): Le texte (et images de texte) a une différence de contraste d'au moins 4.5:1, excepté si le texte est purement décoratif. Les textes de grande taille (au moins 18 points ou 14 points en gras) ou images de texte peuvent avoir une différence de contraste de 3:1. (Niveau AA) 1.4.6 Contraste (Augmenté): Le texte (et images de texte) a une différence de contraste d'au moins 7:1, excepté si le texte est purement décoratif. Les textes de grande taille (au moins 18 points ou 14 points en gras) ou images de texte peuvent avoir une différence de contraste de 4.5:1. (Niveau AAA) Note: Les polices spécialement petites ou décoratives sont difficiles à lire avec un contraste de bas niveau.

source: Protanopia
fr: Protanopie

source: Tritanopia
fr: Tritanopie

source: Deuteranopia
fr: Deutéranopie

source: Color Blindness
fr: Achromatopsie

# passed_normal_AA
source: Normal text passed at level AA
fr: Texte normal conforme au niveaul AA

# failed_normal_AA
source: Normal text failed at level AA
fr: Texte normal non conforme au niveau AA

# passed_normal_AAA
source: Normal text passed at level AAA
fr: Texte normal conforme au niveau AAA

# failed_normal_AAA
source: Normal text failed at level AAA
fr: Texte normal non conforme au niveau AAA

# passed_large_AA
source: Large text passed at level AA
fr: Grand texte conforme au niveau AA

# failed_large_AA
source: Large text failed at level AA
fr: Grand texte non conforme au niveau AA

# passed_large_AAA
source: Large text passed at level AAA
fr: Grand texte conforme au niveau AAA

# failed_large_AAA
source: Large text failed at level AAA
fr: Grand texte non conforme au niveau AAA
